import { Component, Input } from '@angular/core';

@Component({
  selector: 'mill-checkbox-overview',
  templateUrl: './checkbox-page.component.html',
  styleUrls: ['./checkbox-page.component.scss', '../../../assets/styles/overview.scss']
})

export class CheckboxOverviewComponent {
  @Input() label: string;
  @Input() hideLabel: boolean;
  @Input() tabindex: number = 0;

  noticeItems: string[] = [
    'Негативне значення (зазвичай tabindex=”-1”) – елемент не може приймати участь в послідовній навігації за допомогою клавіатури але може бути сфокусованим завдяки JavaScript. В основному корисно створювати доступні віджети за допомогою JavaScript.',
    'Значення 0 – елемент може бути виділений і досягнут за допомогою послідовної навігації, але порядок навігації буде визначений оточенням на сторінці. Наприклад, тег form с набором input елементів: які приймають фокус за допомогою послідовній навігації завдяки стандартній поведінці.',
    'Позитивне ціле значення – елемент буде досягнутий (і виділений) за допомогою послідовної навігації, а порядок навігації визначений цим самим значенням. У разі, якщо кілька елементів містять одне і те ж значення tabindex, їх порядок навігації визначений відносним розташуванням в документі (DOM).'
  ];
}
