import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'input-notice',
  templateUrl: './input-notice.component.html',
  styleUrls: ['./input-notice.component.scss']
})
export class InputNoticeComponent {
  noticeItems = [
    'Якщо обов\'язкове поле в фокусі, а потім фокус знімається без введення даних – повідомлення про обов\'язкове поле не виводиться.',
    'Якщо обов\'язкове поле в фокусі, потім був зроблений уведення даних, потім ці дані були стерті і фокус знятий – виводиться повідомлення про обов\'язкове поле.',
    'Затвердження обов\'язкових полів відбувається при натисканні кнопки Submit.',
    'При помилках в полях введення (в т.ч. про обов\'язкове поле) – екран підскроліюється до самої верхньої помилки.',
    'При відкритті форми – найперше верхнє поле введення, за замовчуванням виявляється у фокусі.'
  ];
}
